src/tr069/samples/tr069_get_rpc_methods_req.xml

<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soap:Header>
      <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
      <cwmp:NoMoreRequests>1</cwmp:NoMoreRequests>
    </soap:Header>
    <soapenv:Body>
      <cwmp:GetRPCMethods>
      </cwmp:GetRPCMethods>
    </soapenv:Body>
</soap:Envelope>
